Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFG064.atdf
      <value-group caption="High/Low Digital Comparator x Event bit" name="ADCCMPCON2__IEHILO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="High/High Digital Comparator x Event bit" name="ADCCMPCON2__IEHIHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPHI &lt; DATA&lt;31:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Between Low/High Digital Comparator x Event bit" name="ADCCMPCON2__IEBTWN">
         <value caption="Generate a digital comparator event when the DCMPLO &lt; DATA&lt;31:0&gt; bits&lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate a digital comparator event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Output True Event Status bit" name="ADCCMPCON2__DCMPED">
         <value caption="Digital Comparator x output true event has occurred (output of Comparator is 1)" name="" value="0x1"/>
         <value caption="Digital Comparator x output is false (output of Comparator is 0)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Global Interrupt Enable bit" name="ADCCMPCON2__DCMPGIEN">
         <value caption="A Digital Comparator x interrupt is generated when the DCMPED status bit (ADCCMPxCON) is set" name="" value="0x1"/>
         <value caption="A Digital Comparator x interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Enable bit" name="ADCCMPCON2__ENDCMP">
         <value caption="Digital Comparator x is enabled" name="" value="0x1"/>
         <value caption="Digital Comparator x is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Analog Input Identification bits" name="ADCCMPCON2__AINID">
         <value caption="AN31 is being monitored" name="" value="0x1f"/>
         <value caption="AN30 is being monitored" name="" value="0x1e"/>
         <value caption="AN1 is being monitored" name="" value="0x1"/>
         <value caption="AN0 is being monitored" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low/Low Digital Comparator x Event bit" name="ADCCMPCON3__IELOLO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPLO&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low/High Digital Comparator x Event bit" name="ADCCMPCON3__IELOHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPLO &lt; DATA&lt;31:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="High/Low Digital Comparator x Event bit" name="ADCCMPCON3__IEHILO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="High/High Digital Comparator x Event bit" name="ADCCMPCON3__IEHIHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPHI &lt; DATA&lt;31:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Between Low/High Digital Comparator x Event bit" name="ADCCMPCON3__IEBTWN">
         <value caption="Generate a digital comparator event when the DCMPLO &lt; DATA&lt;31:0&gt; bits&lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate a digital comparator event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Output True Event Status bit" name="ADCCMPCON3__DCMPED">
         <value caption="Digital Comparator x output true event has occurred (output of Comparator is 1)" name="" value="0x1"/>
         <value caption="Digital Comparator x output is false (output of Comparator is 0)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Global Interrupt Enable bit" name="ADCCMPCON3__DCMPGIEN">
         <value caption="A Digital Comparator x interrupt is generated when the DCMPED status bit (ADCCMPxCON) is set" name="" value="0x1"/>
         <value caption="A Digital Comparator x interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Enable bit" name="ADCCMPCON3__ENDCMP">
         <value caption="Digital Comparator x is enabled" name="" value="0x1"/>
         <value caption="Digital Comparator x is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Analog Input Identification bits" name="ADCCMPCON3__AINID">
         <value caption="AN31 is being monitored" name="" value="0x1f"/>
         <value caption="AN30 is being monitored" name="" value="0x1e"/>
         <value caption="AN1 is being monitored" name="" value="0x1"/>
         <value caption="AN0 is being monitored" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low/Low Digital Comparator x Event bit" name="ADCCMPCON4__IELOLO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPLO&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low/High Digital Comparator x Event bit" name="ADCCMPCON4__IELOHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPLO &lt; DATA&lt;31:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="High/Low Digital Comparator x Event bit" name="ADCCMPCON4__IEHILO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="High/High Digital Comparator x Event bit" name="ADCCMPCON4__IEHIHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPHI &lt; DATA&lt;31:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Between Low/High Digital Comparator x Event bit" name="ADCCMPCON4__IEBTWN">
         <value caption="Generate a digital comparator event when the DCMPLO &lt; DATA&lt;31:0&gt; bits&lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate a digital comparator event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Output True Event Status bit" name="ADCCMPCON4__DCMPED">
         <value caption="Digital Comparator x output true event has occurred (output of Comparator is 1)" name="" value="0x1"/>
         <value caption="Digital Comparator x output is false (output of Comparator is 0)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Global Interrupt Enable bit" name="ADCCMPCON4__DCMPGIEN">
         <value caption="A Digital Comparator x interrupt is generated when the DCMPED status bit (ADCCMPxCON) is set" name="" value="0x1"/>
         <value caption="A Digital Comparator x interrupt is disabled" name="" value="0x0"/>
      </value-group>
