Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFG064.atdf
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI3CON2__FRMERREN">
         <value caption="Frame Error overflow generates error events" name="" value="0x1"/>
         <value caption="Frame Error does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI3CON2__SPISGNEXT">
         <value caption="Data from RX FIFO is sign extended" name="" value="0x1"/>
         <value caption="Data from RX FIFO is not sign extened" name="" value="0x0"/>
      </value-group>
      <value-group caption="Audio Protocol Mode bit" name="SPI4CON2__AUDMOD">
         <value caption="PCM/DSP mode" name="" value="0x3"/>
         <value caption="Right Justified mode" name="" value="0x2"/>
         <value caption="Left Justified mode" name="" value="0x1"/>
         <value caption="I2S mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Audio Data Format bit" name="SPI4CON2__AUDMONO">
         <value caption="Audio data is mono (Each data word is transmitted on both left and right channels)" name="" value="0x1"/>
         <value caption="Audio data is stereo" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Audio CODEC Support bit" name="SPI4CON2__AUDEN">
         <value caption="Audio protocol enabled" name="" value="0x1"/>
         <value caption="Audio protocol disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ignore Transmit Underrun bit" name="SPI4CON2__IGNTUR">
         <value caption="A TUR is not a critical error and zeros are transmitted until the SPIxTXB is not empty" name="" value="0x1"/>
         <value caption="A TUR is a critical error which stop SPI operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ignore Receive Overflow bit" name="SPI4CON2__IGNROV">
         <value caption="A ROV is not a critical error; during ROV data in the fifo is not overwritten by receive data" name="" value="0x1"/>
         <value caption="A ROV is a critical error which stop SPI operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via SPITUR bit" name="SPI4CON2__SPITUREN">
         <value caption="Transmit Underrun Generates Error Events" name="" value="0x1"/>
         <value caption="Transmit Underrun Does Not Generates Error Events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via SPIROV bit" name="SPI4CON2__SPIROVEN">
         <value caption="Receive overflow generates error events" name="" value="0x1"/>
         <value caption="Receive overflow does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI4CON2__FRMERREN">
         <value caption="Frame Error overflow generates error events" name="" value="0x1"/>
         <value caption="Frame Error does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI4CON2__SPISGNEXT">
         <value caption="Data from RX FIFO is sign extended" name="" value="0x1"/>
         <value caption="Data from RX FIFO is not sign extened" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="00206" name="SQI" version="2">
      <register-group name="SQI">
         <register caption="SQI XIP Control Register 1" name="SQI1XCON1" offset="0x0" rw="RW" size="4">
            <bitfield caption="The boot controller will send the command in Single Lane, Dual Lane, or Quad Lane." mask="0x00000003" name="TYPECMD" values="SQI1XCON1__TYPECMD"/>
            <bitfield caption="The boot controller will send the address in Single Lane, Dual Lane, or Quad Lane." mask="0x0000000C" name="TYPEADDR" values="SQI1XCON1__TYPEADDR"/>
            <bitfield caption="The boot controller will send the mode in Single Lane, Dual Lane, or Quad Lane." mask="0x00000030" name="TYPEMODE" values="SQI1XCON1__TYPEMODE"/>
            <bitfield caption="The boot controller will send the dummy in Single Lange, Dual Lane, or Quad Lane" mask="0x000000C0" name="TYPEDUMMY" values="SQI1XCON1__TYPEDUMMY"/>
            <bitfield caption="The boot controller will receive the data in Single Lane, Dual Lane, or Quad Lane." mask="0x00000300" name="TYPEDATA" values="SQI1XCON1__TYPEDATA"/>
            <bitfield mask="0x0003FC00" name="READOPCODE"/>
            <bitfield caption="" mask="0x001C0000" name="ADDRBYTES" values="SQI1XCON1__ADDRBYTES"/>
            <bitfield caption="Transmit Dummy Bytes bits" mask="0x00E00000" name="DUMMYBYTES" values="SQI1XCON1__DUMMYBYTES"/>
            <bitfield caption="SQI DDR Command Mode bit" mask="0x01000000" name="DDRCMD" values="SQI1XCON1__DDRCMD"/>
            <bitfield caption="SQI Address Mode bit" mask="0x02000000" name="DDRADDR" values="SQI1XCON1__DDRADDR"/>
            <bitfield caption="SQI DDR Mode bit" mask="0x04000000" name="DDRMODE" values="SQI1XCON1__DDRMODE"/>
            <bitfield caption="SQI Dummy DDR Mode bit" mask="0x08000000" name="DDRDUMMY" values="SQI1XCON1__DDRDUMMY"/>
            <bitfield caption="SQI Data DDR Mode bit" mask="0x10000000" name="DDRDATA" values="SQI1XCON1__DDRDATA"/>
            <bitfield caption="SQI Command in SDR Mode bit" mask="0x20000000" name="SDRCMD" values="SQI1XCON1__SDRCMD"/>
         </register>
         <register caption="SQI XIP Control Register 2" name="SQI1XCON2" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MODECODE"/>
            <bitfield caption="Mode Byte Cycle Enable bits" mask="0x00000300" name="MODEBYTES" values="SQI1XCON2__MODEBYTES"/>
            <bitfield caption="Device Select bits" mask="0x00000C00" name="DEVSEL" values="SQI1XCON2__DEVSEL"/>
         </register>
         <register caption="SQI Configuration Register" name="SQI1CFG" offset="0x8" rw="RW" size="4">
            <bitfield caption="Mode Select bits" mask="0x00000007" name="MODE" values="SQI1CFG__MODE"/>
            <bitfield caption="Clock Phase Select bit" mask="0x00000008" name="CPHA" values="SQI1CFG__CPHA"/>
            <bitfield caption="Clock Polarity Select bit" mask="0x00000010" name="CPOL" values="SQI1CFG__CPOL"/>
            <bitfield caption="Data Format Select bit" mask="0x00000020" name="LSBF" values="SQI1CFG__LSBF"/>
            <bitfield mask="0x00000200" name="WP"/>
            <bitfield mask="0x00000400" name="HOLD"/>
            <bitfield caption="Burst Configuration bit" mask="0x00001000" name="BURSTEN" values="SQI1CFG__BURSTEN"/>
            <bitfield caption="Software Reset Select bit" mask="0x00010000" name="RESET" values="SQI1CFG__RESET"/>
            <bitfield caption="Transmit Buffer Reset bit" mask="0x00020000" name="TXBUFRST" values="SQI1CFG__TXBUFRST"/>
            <bitfield caption="Receive Buffer Reset bit" mask="0x00040000" name="RXBUFRST" values="SQI1CFG__RXBUFRST"/>
            <bitfield caption="Control Buffer Reset bit" mask="0x00080000" name="CONBUFRST" values="SQI1CFG__CONBUFRST"/>
            <bitfield caption="Data Output Enable bits" mask="0x00300000" name="DATAEN" values="SQI1CFG__DATAEN"/>
            <bitfield caption="SQI Enable bit" mask="0x00800000" name="SQIEN" values="SQI1CFG__SQIEN"/>
            <bitfield caption="Chip Select Output Enable bits" mask="0x03000000" name="CSEN" values="SQI1CFG__CSEN"/>
         </register>
