Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFG064.atdf
         <register caption="USB Control Status Register 3" name="USBCSR3" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RFRMNUM"/>
            <bitfield caption="Endpoint Registers Select bits" mask="0x000F0000" name="ENDPOINT" values="USBCSR3__ENDPOINT"/>
            <bitfield caption="Test_SE0_NAK Test Mode Select bit" mask="0x01000000" name="NAK" values="USBCSR3__NAK"/>
            <bitfield caption="Test_J Test Mode Select bit" mask="0x02000000" name="TESTJ" values="USBCSR3__TESTJ"/>
            <bitfield caption="Test_K Test Mode Select bit" mask="0x04000000" name="TESTK" values="USBCSR3__TESTK"/>
            <bitfield caption="Test_Packet Test Mode Select bit" mask="0x08000000" name="PACKET" values="USBCSR3__PACKET"/>
            <bitfield caption="Test mode Force Hi-Speed Mode Select bit" mask="0x10000000" name="FORCEHS" values="USBCSR3__FORCEHS"/>
            <bitfield caption="Test mode Force Full-Speed Mode Select bit" mask="0x20000000" name="FORCEFS" values="USBCSR3__FORCEFS"/>
            <bitfield caption="Test Mode Endpoint 0 FIFO Transfer Force bit" mask="0x40000000" name="FIFOACC" values="USBCSR3__FIFOACC"/>
            <bitfield caption="Test Mode Force Host Select bit" mask="0x80000000" name="FORCEHST" values="USBCSR3__FORCEHST"/>
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 0 (Endpoint 0)" name="USBIE0CSR0" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP"/>
            <bitfield mask="0x00010000" name="RXRDY"/>
            <bitfield mask="0x00020000" name="TXRDY"/>
            <bitfield mask="0x00040000" name="STALLED"/>
            <bitfield mask="0x00080000" name="SETUP"/>
            <bitfield mask="0x00100000" name="ERROR"/>
            <bitfield mask="0x00200000" name="REQPKT"/>
            <bitfield mask="0x00400000" name="STATUS"/>
            <bitfield mask="0x00800000" name="NAKTO"/>
            <bitfield mask="0x01000000" name="FLUSH"/>
            <bitfield mask="0x02000000" name="DT"/>
            <bitfield mask="0x04000000" name="DTWE"/>
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 0 (Endpoint 1-7)" name="USBIENCSR0" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP"/>
            <bitfield mask="0x0000F800" name="MULT"/>
            <bitfield mask="0x00010000" name="TXPKTRDY"/>
            <bitfield caption="FIFO Not Empty status bit" mask="0x00020000" name="FIFONE" values="USBIENCSR0__FIFONE"/>
            <bitfield caption="Underrun status bit" mask="0x00040000" name="ERROR" values="USBIENCSR0__ERROR"/>
            <bitfield caption="FIFO Flush control bit" mask="0x00080000" name="FLUSH" values="USBIENCSR0__FLUSH"/>
            <bitfield caption="STALL handshake transmission control bit" mask="0x00100000" name="SETUPPKT" values="USBIENCSR0__SETUPPKT"/>
            <bitfield caption="STALL handshake transmission status bit" mask="0x00200000" name="RXSTALL" values="USBIENCSR0__RXSTALL"/>
            <bitfield caption="Clear Data Toggle Control bit" mask="0x00400000" name="CLRDT" values="USBIENCSR0__CLRDT"/>
            <bitfield caption="Incomplete TX Status bit" mask="0x00800000" name="NAKTMOUT" values="USBIENCSR0__NAKTMOUT"/>
            <bitfield mask="0x01000000" name="DATATGGL"/>
            <bitfield mask="0x02000000" name="DTWREN"/>
            <bitfield caption="Endpoint DMA Request Mode Control bit" mask="0x04000000" name="DMAREQMD" values="USBIENCSR0__DMAREQMD"/>
            <bitfield caption="Force Endpoint Data Toggle Control bit" mask="0x08000000" name="FRCDATTG" values="USBIENCSR0__FRCDATTG"/>
            <bitfield caption="Endpoint DMA Request Enable bit" mask="0x10000000" name="DMAREQEN" values="USBIENCSR0__DMAREQEN"/>
            <bitfield caption="Endpoint Direction Control bit" mask="0x20000000" name="MODE" values="USBIENCSR0__MODE"/>
            <bitfield caption="Auto Set Control bit" mask="0x80000000" name="AUTOSET" values="USBIENCSR0__AUTOSET"/>
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 1 (Endpoint 1-7)" name="USBIENCSR1" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RXMAXP"/>
            <bitfield mask="0x0000F800" name="MULT"/>
            <bitfield caption="Data Packet Reception Status bit" mask="0x00010000" name="RXPKTRDY" values="USBIENCSR1__RXPKTRDY"/>
            <bitfield caption="FIFO Full Status bit" mask="0x00020000" name="FIFOFULL" values="USBIENCSR1__FIFOFULL"/>
            <bitfield caption="Data Overrun Status bit" mask="0x00040000" name="ERROR" values="USBIENCSR1__ERROR"/>
            <bitfield caption="Data Packet Error Status bit" mask="0x00080000" name="DERRNAKT" values="USBIENCSR1__DERRNAKT"/>
            <bitfield caption="Flush FIFO Control bit" mask="0x00100000" name="FLUSH" values="USBIENCSR1__FLUSH"/>
            <bitfield caption="STALL Handshake Control bit" mask="0x00200000" name="REQPKT" values="USBIENCSR1__REQPKT"/>
            <bitfield caption="STALL Handshake Status bit" mask="0x00400000" name="RXSTALL" values="USBIENCSR1__RXSTALL"/>
            <bitfield caption="Clear Data Toggle Control bit" mask="0x00800000" name="CLRDT" values="USBIENCSR1__CLRDT"/>
            <bitfield caption="Incomplete Packet Status bit" mask="0x01000000" name="INCOMPRX" values="USBIENCSR1__INCOMPRX"/>
            <bitfield mask="0x02000000" name="DATATGGL"/>
            <bitfield caption="Data Toggle Write Enable Control bit (" mask="0x04000000" name="DATATWEN" values="USBIENCSR1__DATATWEN"/>
            <bitfield caption="DMA Request Mode Selection bit" mask="0x08000000" name="DMAREQMD" values="USBIENCSR1__DMAREQMD"/>
            <bitfield caption="Disable NYET Handshakes Control/PID Error Status bit" mask="0x10000000" name="PIDERR" values="USBIENCSR1__PIDERR"/>
            <bitfield caption="DMA Request Enable Control bit" mask="0x20000000" name="DMAREQEN" values="USBIENCSR1__DMAREQEN"/>
            <bitfield caption="Isochronous Endpoint Control bit" mask="0x40000000" name="AUTORQ" values="USBIENCSR1__AUTORQ"/>
            <bitfield caption="RXPKTRDY Automatic Clear Control bit" mask="0x80000000" name="AUTOCLR" values="USBIENCSR1__AUTOCLR"/>
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 2 (Endpoint 0)" name="USBIE0CSR2" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="RXCNT"/>
            <bitfield caption="Operating Speed Control bits" mask="0x00C00000" name="SPEED" values="USBIE0CSR2__SPEED"/>
            <bitfield mask="0x0F000000" name="NAKLIM"/>
         </register>
